IDEA Open Model
SecondOrderEffectMethodEc2 Enumeration
Compatible with IDEA StatiCa Beta 20.0
 The type of method for calculation second order effect.
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum SecondOrderEffectMethodEc2
Public Enumeration SecondOrderEffectMethodEc2
Members
Member name | Value | Description
NominalStiffness | 0 |  The following model may be used to estimate the nominal stiffness of slender compression members with arbitrary cross section.
NominalCurvature | 1 |  The method based on nominal curvature. This method is primarily suitable for isolated members with constant normal force and a defined effective length.
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace